Configuration.Kanban_for_1C/src/InformationRegisters/канбан_ИспользуемыеПроектыДоски/канбан_ИспользуемыеПроектыДоски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>канбан_ИспользуемыеПроектыДоски</name>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроектаСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.канбан_Пользователь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>DefinedType.канбан_Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration.Kanban_for_1C/src/InformationRegisters/канбан_ИспользуемыеСтатусыДоски/канбан_ИспользуемыеСтатусыДоски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>канбан_ИспользуемыеСтатусыДоски</name>
  <resources>
    <name>СтатусЗадачи</name>
    <type>
      <types>DefinedType.канбан_СтатусыЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.канбан_Пользователь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration.Kanban_for_1C/src/CommonModules/канбан_КанбанДоска/Module.bsl
// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Получить текст HTML.
// 
// Параметры:
// КанбанДоска - Строка - HTML страница доски.
//  ПоказыватьФотоПользователя - Булево - Показывать фото пользователя
// 
Процедура ТекстHTMLКанбанДоски(КанбанДоска, ПоказыватьФотоПользователя = Истина) Экспорт
	
	Обработки.Канбан_Доска_HTML.ТекстHTMLКанбанДоски(КанбанДоска, ПоказыватьФотоПользователя);
	
КонецПроцедуры

// Используемые проекты доски сохранить.
// 
// Параметры:
//  ИспользуемыеПроектыДоски - см. НовыйПроектыДоски
//  Отказ - Булево
//
Процедура ИспользуемыеПроектыДоскиСохранить(ИспользуемыеПроектыДоски, Отказ = Истина) Экспорт
	
	РегистрыСведений.канбан_ИспользуемыеПроектыДоски.Записать(ИспользуемыеПроектыДоски, Отказ);
	
КонецПроцедуры

// Используемые проекты доски загрузить.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НовыйПроектыДоски
//
Функция ИспользуемыеПроектыДоскиЗагрузить() Экспорт
	
	ПроектыДоски = НовыйПроектыДоски();
	
	РегистрыСведений.канбан_ИспользуемыеПроектыДоски.Загрузить(ПроектыДоски);
	
	Возврат ПроектыДоски;
	
КонецФункции

// Используемые статусы доски сохранить.
// 
// Параметры:
//  ИспользуемыеСтатусыДоски - см. НовыйСтатусыДоски
//  Отказ - Булево
//
Процедура ИспользуемыеСтатусыДоскиСохранить(ИспользуемыеСтатусыДоски, Отказ = Истина) Экспорт
	
	РегистрыСведений.канбан_ИспользуемыеСтатусыДоски.Записать(ИспользуемыеСтатусыДоски, Отказ);
	
КонецПроцедуры

// Используемые статусы доски сохраненные для текущего пользователя
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НовыйСтатусыДоски
//
Функция ИспользуемыеСтатусыДоскиЗагрузить() Экспорт
	
	СтатусыДоски = НовыйСтатусыДоски();
	
	РегистрыСведений.канбан_ИспользуемыеСтатусыДоски.Загрузить(СтатусыДоски);
	
	Возврат СтатусыДоски;
	
КонецФункции

// Изменить статус задаче.
// 
// Параметры:
//  ИдентификаторЗадачаСтрока - Строка
//  ИдентификаторСтатусаСтрока - Строка
//  Отказ - Булево
//
// Возвращаемое значение:
//  ОпределяемыйТип.канбан_Задачи
//
Функция ИзменитьСтатусЗадаче(ИдентификаторЗадачаСтрока, ИдентификаторСтатусаСтрока, Отказ) Экспорт
	
	#Область Задача
	
	ИдентификаторЗадача = Новый УникальныйИдентификатор(ИдентификаторЗадачаСтрока);
	
	ТипыЗадачи = Метаданные.ОпределяемыеТипы.канбан_Задачи.Тип.Типы();
	ЗадачаСсылка = Новый(ТипыЗадачи[0]); // ОпределяемыйТип.канбан_Задачи
	МенеджерОбъектаЗадача = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЗадачаСсылка);
	
	ЗадачаСсылка = МенеджерОбъектаЗадача.ПолучитьСсылку(ИдентификаторЗадача); // ОпределяемыйТип.канбан_Задачи
	
	#КонецОбласти
	
	#Область Статус
	
	ИдентификаторСтатуса = Новый УникальныйИдентификатор(ИдентификаторСтатусаСтрока);
	
	ТипыСтатус = Метаданные.ОпределяемыеТипы.канбан_СтатусыЗадач.Тип.Типы()[0];
	СтатусСсылка = Новый(ТипыСтатус); // СправочникСсылка
	МенеджерОбъектаСтатус = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СтатусСсылка);
	
	СтатусСсылка = МенеджерОбъектаСтатус.ПолучитьСсылку(ИдентификаторСтатуса); // ОпределяемыйТип.канбан_СтатусыЗадач
	
	#КонецОбласти
	
	канбан_КанбанДоскаПереопределяемый.ИзменитьСтатусЗадаче(ЗадачаСсылка, СтатусСсылка, Отказ);
	
	Возврат ЗадачаСсылка;
	
КонецФункции

// Данные для канбан доски.
// 
// Возвращаемое значение:
//  см. НовыйДанныеДляКанбанДоски
//
Функция ДанныеДляКанбанДоски() Экспорт
	
	ТекстЗапросаДанныеЗадач = канбан_КанбанДоскаПереопределяемый.ТекстЗапросаДанныеЗадач();
	
	ДанныеДляКанбанДоски = НовыйДанныеДляКанбанДоски();
	
	ДанныеДляКанбанДоски.Проекты = ИспользуемыеПроектыДоскиЗагрузить();
	
	Проекты = ДанныеДляКанбанДоски.Проекты;
	
	// TODO вынести в отдельную процедуру
	Если Проекты.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаДанныеЗадач;
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаПроектов = РезультатЗапроса.Выгрузить();
		ТаблицаПроектов.Свернуть("Проект");
		Для Каждого СтрокаПроекта Из ТаблицаПроектов Цикл
			
			НоваяСтрокаПроектов = Проекты.Добавить();
			НоваяСтрокаПроектов.Проект = СтрокаПроекта.Проект;
			// TODO нужно поле наименование и ГУИД делать в запросе что бы не дублировать запрос
			НоваяСтрокаПроектов.ПредставлениеПроекта = СтрокаПроекта.Проект.Наименование;
			НоваяСтрокаПроектов.ИдентификаторПроектаСтрока = Строка(СтрокаПроекта.Проект.УникальныйИдентификатор());
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыОтбора = НовыйПараметрыОтбораЗадач();
	
	ПараметрыОтбора.Проекты = Проекты.ВыгрузитьКолонку("Проект"); // Массив из ОпределяемыйТип.канбан_Проекты
	
	ТекстЗапросаСтатусы = канбан_КанбанДоскаПереопределяемый.ТекстЗапросаСтатусы();
	РегистрыСведений.канбан_ИспользуемыеСтатусыДоски.Статусы(ТекстЗапросаСтатусы, ДанныеДляКанбанДоски);
	
	ДополнитьЗапросДанныеЗадач(ТекстЗапросаДанныеЗадач);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеЗадач;
	
	Запрос.УстановитьПараметр("Проекты", ПараметрыОтбора.Проекты);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыОтбора.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДанныеДляКанбанДоски.ЗадачиИСтатусы.Добавить();
		НоваяСтрока.Задача = Выборка.Задача;
		НоваяСтрока.Статус = Выборка.СтатусЗадачи;
		
		КартинкаПоУмолчанию = БиблиотекаКартинок.канбан_ФотоПоУмолчанию;
		ХранилищеФотографии = Выборка.ХранилищеФотографии;
		Если ПустаяСтрока(ХранилищеФотографии) 
			Или ХранилищеФотографии.Получить() =  Неопределено Тогда
			
			ДвоичныеДанныеФотографии = КартинкаПоУмолчанию.ПолучитьДвоичныеДанные();
			
		Иначе
			
			ДвоичныеДанныеФотографии = ХранилищеФотографии.Получить();
			
		КонецЕсли;
		
		ФотографияСтрокаBase64 = Base64Строка(ДвоичныеДанныеФотографии);
		НоваяСтрока.ФотографияИсполнителя = СтрШаблон("data:image/jpeg;base64,%1", ФотографияСтрокаBase64);
		
		НоваяСтрока.Наименование = Выборка.НаименованиеЗадачи;
		
		СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(Выборка.Задача);
		СсылкаНаИБ = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		НоваяСтрока.НавигационнаяСсылка = СтрШаблон("%1#%2", СсылкаНаИБ, СсылкаНаОбъект);
		
		НоваяСтрока.ИдентификаторЗадача = Строка(Выборка.Задача.УникальныйИдентификатор());
		НоваяСтрока.Код = Выборка.КодЗадачи;
		НоваяСтрока.Проект = Выборка.Проект;
		НоваяСтрока.ПредставлениеПроекта = Строка(Выборка.Проект);
		НоваяСтрока.ЦветПроекта = Выборка.ЦветПроекта;
		НоваяСтрока.ИдентификаторПроекта = Выборка.ИдентификаторПроектаСтрока;
		НоваяСтрока.ИдентификаторПользователя = 
			?(Выборка.Исполнитель.Пустая(), "", Строка(Выборка.Исполнитель.УникальныйИдентификатор()));
		
	КонецЦикла;
	
	Возврат ДанныеДляКанбанДоски;
	
КонецФункции

// Получает текст HTML из объекта ДокументHTML.
//
// Параметры:
//  ДокументHTML  - ДокументHTML - документ, из которого будет извлекаться текст.
//
// Возвращаемое значение:
//   Строка   - текст HTML
//
Функция ТекстHTMLИзОбъектаДокументHTML(Знач ДокументHTML) Экспорт
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
	
	Возврат ЗаписьHTML.Закрыть();
	
КонецФункции

// Получить объект документ HTMLИз текста HTML. // Заимствована из ОбщийМодуль.Взаимодействие:
// 
// Параметры:
//  ТекстHTML  - Строка
//  Кодировка - Строка
// 
// Возвращаемое значение:
//   ДокументHTML   - созданный документ HTML.
//
Функция ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстHTML, Кодировка = "") Экспорт
	
	Построитель = Новый ПостроительDOM;
	ЧтениеHTML = Новый ЧтениеHTML;
	
	Попытка
	
		ЧтениеHTML.УстановитьСтроку(ТекстHTML, Кодировка);
	
	Исключение
		
		ЧтениеHTML.УстановитьСтроку(ТекстHTML);
		
	КонецПопытки;
	
	Возврат Построитель.Прочитать(ЧтениеHTML);
	
КонецФункции

// Установить объект запроса.
// 
// Параметры:
//  ТекстЗапроса - Строка
//  ИмяОпределяемогоТипа - Строка
//
Процедура УстановитьОбъектЗапроса(ТекстЗапроса, ИмяОпределяемогоТипа) Экспорт
	
	ПолноеИмяОбъекта = ПолноеИмяОбъектаМетаданныхОпределяемогоТипа(ИмяОпределяемогоТипа);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбъектЗапроса", ПолноеИмяОбъекта);
	
КонецПроцедуры

// Полное имя объекта метаданных определяемого типа.
// 
// Параметры:
//  ИмяОпределяемогоТипа - Строка
// 
// Возвращаемое значение:
//  Строка - Полное имя объекта метаданных определяемого типа
//
Функция ПолноеИмяОбъектаМетаданныхОпределяемогоТипа(ИмяОпределяемогоТипа) Экспорт
	
	Тип = Метаданные.ОпределяемыеТипы[ИмяОпределяемогоТипа].Тип.Типы()[0];
	ТипСсылка = Новый (Тип); // СправочникСсылка
	МетаданныеТипа = ТипСсылка.Метаданные();
	
	ПолноеИмяОбъекта = МетаданныеТипа.ПолноеИмя();
	
	Возврат ПолноеИмяОбъекта; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый параметры отбора задач.
// 
// Возвращаемое значение:
//  Структура - Новый параметры отбора задач:
//  * Проекты - Массив из ОпределяемыйТип.канбан_Проекты
//  * ТекущийПользователь - ОпределяемыйТип.канбан_Пользователь
//
Функция НовыйПараметрыОтбораЗадач() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Проекты", Новый Массив);
	Результат.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Возврат Результат;
	
КонецФункции

// Новый данные для канбан доски.
// 
// Возвращаемое значение:
//  Структура:
// * Статусы - см. НовыйСтатусыДоски
// * ЗадачиИСтатусы - см. НовыйЗадачиИСтатусы
// * Проекты - см. НовыйПроектыДоски
//
Функция НовыйДанныеДляКанбанДоски() Экспорт
	
	СтатусыДоски = НовыйСтатусыДоски();
	
	ЗадачиИСтатусы = НовыйЗадачиИСтатусы();
	
	Проекты = НовыйПроектыДоски();
	
	ДанныеДляКанбанДоски = Новый Структура;
	ДанныеДляКанбанДоски.Вставить("Статусы", СтатусыДоски);
	ДанныеДляКанбанДоски.Вставить("ЗадачиИСтатусы", ЗадачиИСтатусы);
	ДанныеДляКанбанДоски.Вставить("Проекты", Проекты);
	
	Возврат ДанныеДляКанбанДоски;
	
КонецФункции

// Новый статусы доски.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый статусы доски:
// * СтатусЗадачи - ОпределяемыйТип.канбан_СтатусыЗадач
// * НомерПоПорядку - Число
// * КнопкаДобавить - Булево
// * Представление - Строка
//
Функция НовыйСтатусыДоски() Экспорт
	
	СтатусыДоски = Новый ТаблицаЗначений;
	СтатусыДоски.Колонки.Добавить("СтатусЗадачи", Метаданные.ОпределяемыеТипы.канбан_СтатусыЗадач.Тип);
	СтатусыДоски.Колонки.Добавить("НомерПоПорядку", Новый ОписаниеТипов("Число"));
	СтатусыДоски.Колонки.Добавить("КнопкаДобавить", Новый ОписаниеТипов("Булево"));
	СтатусыДоски.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	Возврат СтатусыДоски;
	
КонецФункции

// Новый задачи и статусы.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый задачи и статусы:
// * Задача - ОпределяемыйТип.канбан_Задачи
// * Наименование - Строка
// * Код - Строка
// * Статус - ОпределяемыйТип.канбан_СтатусыЗадач
// * ФотографияИсполнителя - Строка
// * ИдентификаторПользователя - Строка
// * НавигационнаяСсылка - Строка
// * ИдентификаторЗадача - Строка
// * Проект - ОпределяемыйТип.канбан_Проекты
// * ПредставлениеПроекта - Строка
// * ИдентификаторПроекта - Строка
// * ЦветПроекта - Строка
//
Функция НовыйЗадачиИСтатусы()
	
	ЗадачиИСтатусы = Новый ТаблицаЗначений;
	ЗадачиИСтатусы.Колонки.Добавить("Задача", Метаданные.ОпределяемыеТипы.канбан_Задачи.Тип);
	ЗадачиИСтатусы.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("Статус", Метаданные.ОпределяемыеТипы.канбан_СтатусыЗадач.Тип);
	ЗадачиИСтатусы.Колонки.Добавить("ФотографияИсполнителя", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("ИдентификаторПользователя", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("НавигационнаяСсылка", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("ИдентификаторЗадача", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("Проект", Метаданные.ОпределяемыеТипы.канбан_Проекты.Тип);
	ЗадачиИСтатусы.Колонки.Добавить("ПредставлениеПроекта", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("ИдентификаторПроекта", Новый ОписаниеТипов("Строка"));
	ЗадачиИСтатусы.Колонки.Добавить("ЦветПроекта", Новый ОписаниеТипов("Строка"));
	
	Возврат ЗадачиИСтатусы;
	
КонецФункции

// Новый проекты доски.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый проекты доски:
// * Проект - ОпределяемыйТип.канбан_Проекты
// * Цвет - Строка
// * ИдентификаторПроектаСтрока - Строка
// * ПредставлениеПроекта - Строка
//
Функция НовыйПроектыДоски() Экспорт
	
	ПроектыДоски = Новый ТаблицаЗначений();
	ПроектыДоски.Колонки.Добавить("Проект", Метаданные.ОпределяемыеТипы.канбан_Проекты.Тип);
	ПроектыДоски.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Строка"));
	ПроектыДоски.Колонки.Добавить("ИдентификаторПроектаСтрока", Новый ОписаниеТипов("Строка"));
	ПроектыДоски.Колонки.Добавить("ПредставлениеПроекта", Новый ОписаниеТипов("Строка"));
	
	Возврат ПроектыДоски;
	
КонецФункции

Функция КлючОбъекта()
	Возврат "КанбанДоскаHTML";
КонецФункции

// Дополнить запрос данные задач.
// 
// Параметры:
//  ТекстЗапросаДанныеЗадач - см. канбан_КанбанДоскаПереопределяемый.ТекстЗапросаДанныеЗадач
// 
Процедура ДополнитьЗапросДанныеЗадач(ТекстЗапросаДанныеЗадач)
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаДанныеЗадач);
	ПервыйПакет = СхемаЗапроса.ПакетЗапросов.Получить(0);
	Оператор = ПервыйПакет.Операторы[0];
	
	#Область ДанныеСтатусов
	
	// Соединяем с таблицей используемых статусов, отсекаем лишние задачи.
	ИспользуемыеСтатусыДоски = Оператор.Источники.Добавить(
		"РегистрСведений.канбан_ИспользуемыеСтатусыДоски", "ИспользуемыеСтатусыДоски");
	
	Оператор.Источники[3].Соединения.Очистить();
	
	// TODO тут нужно заменить условие, т.к. я не знаю что есть справочник"Задачи.Проект" нужно искать это поле по наименованию
	Оператор.Источники[0].Соединения.Добавить(
		ИспользуемыеСтатусыДоски, 
		"Задачи.Статус = ИспользуемыеСтатусыДоски.СтатусЗадачи И ИспользуемыеСтатусыДоски.Пользователь = &ТекущийПользователь");
	
	Оператор.Источники[0].Соединения[2].ТипСоединения = ТипСоединенияСхемыЗапроса.ВНУТРЕННЕЕ;
	
	#КонецОбласти
	
	#Область ДанныеПроектов
	
	ИспользуемыеПроектыДоски = Оператор.Источники.Добавить(
		"РегистрСведений.канбан_ИспользуемыеПроектыДоски", "ИспользуемыеПроектыДоски");
	
	Оператор.Источники[4].Соединения.Очистить();
	
	// TODO тут нужно заменить условие, т.к. я не знаю что есть справочник"Задачи.Проект" нужно искать это поле по наименованию
	Оператор.Источники[0].Соединения.Добавить(
		ИспользуемыеПроектыДоски, 
		"ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) = ИспользуемыеПроектыДоски.Проект И ИспользуемыеПроектыДоски.Пользователь = &ТекущийПользователь");
	
	Оператор.Источники[0].Соединения[3].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее; // Получаем все проекты, отберем их условием
	
	Оператор.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ИспользуемыеПроектыДоски.Цвет, """")", 8);
	ПервыйПакет.Колонки[8].Псевдоним = "ЦветПроекта";
	
	Оператор.ВыбираемыеПоля.Добавить("УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект))", 9);
	ПервыйПакет.Колонки[9].Псевдоним = "ИдентификаторПроектаСтрока";
	
	// TODO тут нужно заменить условие, т.к. я не знаю что есть справочник"Задачи.Проект" нужно искать это поле по наименованию
	Оператор.Отбор.Добавить("ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) В (&Проекты)");
	
	#КонецОбласти
	
//	ПервыйПакет.Порядок.Добавить("КодЗадачи");
	
	ТекстЗапросаДанныеЗадач = СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецПроцедуры

#КонецОбласти
